Revit 2024 API
Transform2D.IsConformal Property
 The boolean value that indicates whether this transformation is conformal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsConformal { get; }
Visual Basic
Public ReadOnly Property IsConformal As Boolean
	Get
Visual C++
public:
property bool IsConformal {
	bool get ();
}
Remarks
 This property is true if this transformation can be decomposed as the product of a rigid-body motion, uniform scale and reflection. Such transformation preserves angles between vectors.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace